{
  "char_to_idx": {
    "<BLANK>": 0,
    " ": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "%": 5,
    "'": 6,
    "(": 7,
    ")": 8,
    "*": 9,
    "+": 10,
    ",": 11,
    "-": 12,
    ".": 13,
    "/": 14,
    "0": 15,
    "1": 16,
    "2": 17,
    "3": 18,
    "4": 19,
    "5": 20,
    "6": 21,
    "7": 22,
    "8": 23,
    "9": 24,
    ":": 25,
    ";": 26,
    "=": 27,
    ">": 28,
    "?": 29,
    "A": 30,
    "G": 31,
    "J": 32,
    "N": 33,
    "_": 34,
    "a": 35,
    "d": 36,
    "h": 37,
    "l": 38,
    "t": 39,
    "~": 40,
    "ँ": 41,
    "ं": 42,
    "ः": 43,
    "अ": 44,
    "आ": 45,
    "इ": 46,
    "ई": 47,
    "उ": 48,
    "ऊ": 49,
    "ऋ": 50,
    "ऍ": 51,
    "ऎ": 52,
    "ए": 53,
    "ऐ": 54,
    "ऑ": 55,
    "ओ": 56,
    "औ": 57,
    "क": 58,
    "ख": 59,
    "ग": 60,
    "घ": 61,
    "ङ": 62,
    "च": 63,
    "छ": 64,
    "ज": 65,
    "झ": 66,
    "ञ": 67,
    "ट": 68,
    "ठ": 69,
    "ड": 70,
    "ढ": 71,
    "ण": 72,
    "त": 73,
    "थ": 74,
    "द": 75,
    "ध": 76,
    "न": 77,
    "ऩ": 78,
    "प": 79,
    "फ": 80,
    "ब": 81,
    "भ": 82,
    "म": 83,
    "य": 84,
    "र": 85,
    "ऱ": 86,
    "ल": 87,
    "ळ": 88,
    "ऴ": 89,
    "व": 90,
    "श": 91,
    "ष": 92,
    "स": 93,
    "ह": 94,
    "़": 95,
    "ऽ": 96,
    "ा": 97,
    "ि": 98,
    "ी": 99,
    "ु": 100,
    "ू": 101,
    "ृ": 102,
    "ॄ": 103,
    "ॅ": 104,
    "ॆ": 105,
    "े": 106,
    "ै": 107,
    "ॉ": 108,
    "ॊ": 109,
    "ो": 110,
    "ौ": 111,
    "्": 112,
    "ॐ": 113,
    "॑": 114,
    "॓": 115,
    "ॠ": 116,
    "ॢ": 117,
    "।": 118,
    "॥": 119,
    "०": 120,
    "१": 121,
    "२": 122,
    "३": 123,
    "४": 124,
    "५": 125,
    "६": 126,
    "७": 127,
    "८": 128,
    "९": 129,
    "॰": 130,
    "ॻ": 131,
    "ॽ": 132,
    "‌": 133,
    "‍": 134,
    "“": 135,
    "”": 136,
    "<UNK>": 137,
    "<PAD>": 138
  },
  "idx_to_char": {
    "0": "<BLANK>",
    "1": " ",
    "2": "!",
    "3": "\"",
    "4": "#",
    "5": "%",
    "6": "'",
    "7": "(",
    "8": ")",
    "9": "*",
    "10": "+",
    "11": ",",
    "12": "-",
    "13": ".",
    "14": "/",
    "15": "0",
    "16": "1",
    "17": "2",
    "18": "3",
    "19": "4",
    "20": "5",
    "21": "6",
    "22": "7",
    "23": "8",
    "24": "9",
    "25": ":",
    "26": ";",
    "27": "=",
    "28": ">",
    "29": "?",
    "30": "A",
    "31": "G",
    "32": "J",
    "33": "N",
    "34": "_",
    "35": "a",
    "36": "d",
    "37": "h",
    "38": "l",
    "39": "t",
    "40": "~",
    "41": "ँ",
    "42": "ं",
    "43": "ः",
    "44": "अ",
    "45": "आ",
    "46": "इ",
    "47": "ई",
    "48": "उ",
    "49": "ऊ",
    "50": "ऋ",
    "51": "ऍ",
    "52": "ऎ",
    "53": "ए",
    "54": "ऐ",
    "55": "ऑ",
    "56": "ओ",
    "57": "औ",
    "58": "क",
    "59": "ख",
    "60": "ग",
    "61": "घ",
    "62": "ङ",
    "63": "च",
    "64": "छ",
    "65": "ज",
    "66": "झ",
    "67": "ञ",
    "68": "ट",
    "69": "ठ",
    "70": "ड",
    "71": "ढ",
    "72": "ण",
    "73": "त",
    "74": "थ",
    "75": "द",
    "76": "ध",
    "77": "न",
    "78": "ऩ",
    "79": "प",
    "80": "फ",
    "81": "ब",
    "82": "भ",
    "83": "म",
    "84": "य",
    "85": "र",
    "86": "ऱ",
    "87": "ल",
    "88": "ळ",
    "89": "ऴ",
    "90": "व",
    "91": "श",
    "92": "ष",
    "93": "स",
    "94": "ह",
    "95": "़",
    "96": "ऽ",
    "97": "ा",
    "98": "ि",
    "99": "ी",
    "100": "ु",
    "101": "ू",
    "102": "ृ",
    "103": "ॄ",
    "104": "ॅ",
    "105": "ॆ",
    "106": "े",
    "107": "ै",
    "108": "ॉ",
    "109": "ॊ",
    "110": "ो",
    "111": "ौ",
    "112": "्",
    "113": "ॐ",
    "114": "॑",
    "115": "॓",
    "116": "ॠ",
    "117": "ॢ",
    "118": "।",
    "119": "॥",
    "120": "०",
    "121": "१",
    "122": "२",
    "123": "३",
    "124": "४",
    "125": "५",
    "126": "६",
    "127": "७",
    "128": "८",
    "129": "९",
    "130": "॰",
    "131": "ॻ",
    "132": "ॽ",
    "133": "‌",
    "134": "‍",
    "135": "“",
    "136": "”",
    "137": "<UNK>",
    "138": "<PAD>"
  },
  "blank_idx": 0,
  "unk_idx": 137,
  "pad_idx": 138,
  "unicode_normalization": "NFC"
}