{
  "char_to_idx": {
    "<BLANK>": 0,
    "-": 1,
    "ँ": 2,
    "ं": 3,
    "ः": 4,
    "अ": 5,
    "आ": 6,
    "इ": 7,
    "ई": 8,
    "उ": 9,
    "ऊ": 10,
    "ऋ": 11,
    "ऌ": 12,
    "ऍ": 13,
    "ऎ": 14,
    "ए": 15,
    "ऐ": 16,
    "ऑ": 17,
    "ऒ": 18,
    "ओ": 19,
    "औ": 20,
    "क": 21,
    "ख": 22,
    "ग": 23,
    "घ": 24,
    "ङ": 25,
    "च": 26,
    "छ": 27,
    "ज": 28,
    "झ": 29,
    "ञ": 30,
    "ट": 31,
    "ठ": 32,
    "ड": 33,
    "ढ": 34,
    "ण": 35,
    "त": 36,
    "थ": 37,
    "द": 38,
    "ध": 39,
    "न": 40,
    "ऩ": 41,
    "प": 42,
    "फ": 43,
    "ब": 44,
    "भ": 45,
    "म": 46,
    "य": 47,
    "र": 48,
    "ऱ": 49,
    "ल": 50,
    "ळ": 51,
    "ऴ": 52,
    "व": 53,
    "श": 54,
    "ष": 55,
    "स": 56,
    "ह": 57,
    "़": 58,
    "ऽ": 59,
    "ा": 60,
    "ि": 61,
    "ी": 62,
    "ु": 63,
    "ू": 64,
    "ृ": 65,
    "ॄ": 66,
    "ॅ": 67,
    "े": 68,
    "ै": 69,
    "ॉ": 70,
    "ॊ": 71,
    "ो": 72,
    "ौ": 73,
    "्": 74,
    "ॐ": 75,
    "॑": 76,
    "॒": 77,
    "॓": 78,
    "॔": 79,
    "ॠ": 80,
    "ॢ": 81,
    "।": 82,
    "॥": 83,
    "०": 84,
    "१": 85,
    "२": 86,
    "३": 87,
    "४": 88,
    "५": 89,
    "६": 90,
    "७": 91,
    "८": 92,
    "९": 93,
    "॰": 94,
    "ॱ": 95,
    "ॲ": 96,
    "ॻ": 97,
    "ॼ": 98,
    "ॽ": 99,
    "ॾ": 100,
    "<UNK>": 101,
    "<PAD>": 102
  },
  "idx_to_char": {
    "0": "<BLANK>",
    "1": "-",
    "2": "ँ",
    "3": "ं",
    "4": "ः",
    "5": "अ",
    "6": "आ",
    "7": "इ",
    "8": "ई",
    "9": "उ",
    "10": "ऊ",
    "11": "ऋ",
    "12": "ऌ",
    "13": "ऍ",
    "14": "ऎ",
    "15": "ए",
    "16": "ऐ",
    "17": "ऑ",
    "18": "ऒ",
    "19": "ओ",
    "20": "औ",
    "21": "क",
    "22": "ख",
    "23": "ग",
    "24": "घ",
    "25": "ङ",
    "26": "च",
    "27": "छ",
    "28": "ज",
    "29": "झ",
    "30": "ञ",
    "31": "ट",
    "32": "ठ",
    "33": "ड",
    "34": "ढ",
    "35": "ण",
    "36": "त",
    "37": "थ",
    "38": "द",
    "39": "ध",
    "40": "न",
    "41": "ऩ",
    "42": "प",
    "43": "फ",
    "44": "ब",
    "45": "भ",
    "46": "म",
    "47": "य",
    "48": "र",
    "49": "ऱ",
    "50": "ल",
    "51": "ळ",
    "52": "ऴ",
    "53": "व",
    "54": "श",
    "55": "ष",
    "56": "स",
    "57": "ह",
    "58": "़",
    "59": "ऽ",
    "60": "ा",
    "61": "ि",
    "62": "ी",
    "63": "ु",
    "64": "ू",
    "65": "ृ",
    "66": "ॄ",
    "67": "ॅ",
    "68": "े",
    "69": "ै",
    "70": "ॉ",
    "71": "ॊ",
    "72": "ो",
    "73": "ौ",
    "74": "्",
    "75": "ॐ",
    "76": "॑",
    "77": "॒",
    "78": "॓",
    "79": "॔",
    "80": "ॠ",
    "81": "ॢ",
    "82": "।",
    "83": "॥",
    "84": "०",
    "85": "१",
    "86": "२",
    "87": "३",
    "88": "४",
    "89": "५",
    "90": "६",
    "91": "७",
    "92": "८",
    "93": "९",
    "94": "॰",
    "95": "ॱ",
    "96": "ॲ",
    "97": "ॻ",
    "98": "ॼ",
    "99": "ॽ",
    "100": "ॾ",
    "101": "<UNK>",
    "102": "<PAD>"
  },
  "blank_idx": 0,
  "unk_idx": 101,
  "pad_idx": 102,
  "unicode_normalization": "NFC"
}